{"class_name": "Model", "keras_version": "2.2.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 224, 224, 3], "name": "input_2", "sparse": false}, "inbound_nodes": [], "name": "input_2"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Conv1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "Conv1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn_Conv1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.999, "center": true}, "inbound_nodes": [[["Conv1", 0, 0, {}]]], "name": "bn_Conv1"}, {"class_name": "ReLU", "config": {"max_value": 6.0, "trainable": true, "name": "Conv1_relu"}, "inbound_nodes": [[["bn_Conv1", 0, 0, {}]]], "name": "Conv1_relu"}, {"class_name": "DepthwiseConv2D", "config": {"use_bias": false, "trainable": true, "name": "expanded_conv_depthwise", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "depth_multiplier": 1, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["Conv1_relu", 0, 0, {}]]], "name": "expanded_conv_depthwise"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "expanded_conv_depthwise_BN", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.999, "center": true}, "inbound_nodes": [[["expanded_conv_depthwise", 0, 0, {}]]], "name": "expanded_conv_depthwise_BN"}, {"class_name": "ReLU", "config": {"max_value": 6.0, "trainable": true, "name": "expanded_conv_depthwise_relu"}, "inbound_nodes": [[["expanded_conv_depthwise_BN", 0, 0, {}]]], "name": "expanded_conv_depthwise_relu"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "expanded_conv_project", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["expanded_conv_depthwise_relu", 0, 0, {}]]], "name": "expanded_conv_project"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "expanded_conv_project_BN", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.999, "center": true}, "inbound_nodes": [[["expanded_conv_project", 0, 0, {}]]], "name": "expanded_conv_project_BN"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block_1_expand", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["expanded_conv_project_BN", 0, 0, {}]]], "name": "block_1_expand"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_1_expand_BN", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.999, "center": true}, "inbound_nodes": [[["block_1_expand", 0, 0, {}]]], "name": "block_1_expand_BN"}, {"class_name": "ReLU", "config": {"max_value": 6.0, "trainable": true, "name": "block_1_expand_relu"}, "inbound_nodes": [[["block_1_expand_BN", 0, 0, {}]]], "name": "block_1_expand_relu"}, {"class_name": "DepthwiseConv2D", "config": {"use_bias": false, "trainable": true, "name": "block_1_depthwise", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "depth_multiplier": 1, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [2, 2], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["block_1_expand_relu", 0, 0, {}]]], "name": "block_1_depthwise"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_1_depthwise_BN", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.999, "center": true}, "inbound_nodes": [[["block_1_depthwise", 0, 0, {}]]], "name": "block_1_depthwise_BN"}, {"class_name": "ReLU", "config": {"max_value": 6.0, "trainable": true, "name": "block_1_depthwise_relu"}, "inbound_nodes": [[["block_1_depthwise_BN", 0, 0, {}]]], "name": "block_1_depthwise_relu"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block_1_project", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 24, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["block_1_depthwise_relu", 0, 0, {}]]], "name": "block_1_project"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_1_project_BN", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.999, "center": true}, "inbound_nodes": [[["block_1_project", 0, 0, {}]]], "name": "block_1_project_BN"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block_2_expand", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 144, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["block_1_project_BN", 0, 0, {}]]], "name": "block_2_expand"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_2_expand_BN", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.999, "center": true}, "inbound_nodes": [[["block_2_expand", 0, 0, {}]]], "name": "block_2_expand_BN"}, {"class_name": "ReLU", "config": {"max_value": 6.0, "trainable": true, "name": "block_2_expand_relu"}, "inbound_nodes": [[["block_2_expand_BN", 0, 0, {}]]], "name": "block_2_expand_relu"}, {"class_name": "DepthwiseConv2D", "config": {"use_bias": false, "trainable": true, "name": "block_2_depthwise", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "depth_multiplier": 1, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["block_2_expand_relu", 0, 0, {}]]], "name": "block_2_depthwise"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_2_depthwise_BN", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.999, "center": true}, "inbound_nodes": [[["block_2_depthwise", 0, 0, {}]]], "name": "block_2_depthwise_BN"}, {"class_name": "ReLU", "config": {"max_value": 6.0, "trainable": true, "name": "block_2_depthwise_relu"}, "inbound_nodes": [[["block_2_depthwise_BN", 0, 0, {}]]], "name": "block_2_depthwise_relu"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block_2_project", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 24, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["block_2_depthwise_relu", 0, 0, {}]]], "name": "block_2_project"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_2_project_BN", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.999, "center": true}, "inbound_nodes": [[["block_2_project", 0, 0, {}]]], "name": "block_2_project_BN"}, {"class_name": "Add", "config": {"trainable": true, "name": "block_2_add"}, "inbound_nodes": [[["block_1_project_BN", 0, 0, {}], ["block_2_project_BN", 0, 0, {}]]], "name": "block_2_add"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block_3_expand", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 144, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["block_2_add", 0, 0, {}]]], "name": "block_3_expand"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_3_expand_BN", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.999, "center": true}, "inbound_nodes": [[["block_3_expand", 0, 0, {}]]], "name": "block_3_expand_BN"}, {"class_name": "ReLU", "config": {"max_value": 6.0, "trainable": true, "name": "block_3_expand_relu"}, "inbound_nodes": [[["block_3_expand_BN", 0, 0, {}]]], "name": "block_3_expand_relu"}, {"class_name": "DepthwiseConv2D", "config": {"use_bias": false, "trainable": true, "name": "block_3_depthwise", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "depth_multiplier": 1, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [2, 2], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["block_3_expand_relu", 0, 0, {}]]], "name": "block_3_depthwise"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_3_depthwise_BN", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.999, "center": true}, "inbound_nodes": [[["block_3_depthwise", 0, 0, {}]]], "name": "block_3_depthwise_BN"}, {"class_name": "ReLU", "config": {"max_value": 6.0, "trainable": true, "name": "block_3_depthwise_relu"}, "inbound_nodes": [[["block_3_depthwise_BN", 0, 0, {}]]], "name": "block_3_depthwise_relu"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block_3_project", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["block_3_depthwise_relu", 0, 0, {}]]], "name": "block_3_project"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_3_project_BN", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.999, "center": true}, "inbound_nodes": [[["block_3_project", 0, 0, {}]]], "name": "block_3_project_BN"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block_4_expand", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 192, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["block_3_project_BN", 0, 0, {}]]], "name": "block_4_expand"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_4_expand_BN", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.999, "center": true}, "inbound_nodes": [[["block_4_expand", 0, 0, {}]]], "name": "block_4_expand_BN"}, {"class_name": "ReLU", "config": {"max_value": 6.0, "trainable": true, "name": "block_4_expand_relu"}, "inbound_nodes": [[["block_4_expand_BN", 0, 0, {}]]], "name": "block_4_expand_relu"}, {"class_name": "DepthwiseConv2D", "config": {"use_bias": false, "trainable": true, "name": "block_4_depthwise", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "depth_multiplier": 1, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["block_4_expand_relu", 0, 0, {}]]], "name": "block_4_depthwise"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_4_depthwise_BN", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.999, "center": true}, "inbound_nodes": [[["block_4_depthwise", 0, 0, {}]]], "name": "block_4_depthwise_BN"}, {"class_name": "ReLU", "config": {"max_value": 6.0, "trainable": true, "name": "block_4_depthwise_relu"}, "inbound_nodes": [[["block_4_depthwise_BN", 0, 0, {}]]], "name": "block_4_depthwise_relu"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block_4_project", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["block_4_depthwise_relu", 0, 0, {}]]], "name": "block_4_project"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_4_project_BN", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.999, "center": true}, "inbound_nodes": [[["block_4_project", 0, 0, {}]]], "name": "block_4_project_BN"}, {"class_name": "Add", "config": {"trainable": true, "name": "block_4_add"}, "inbound_nodes": [[["block_3_project_BN", 0, 0, {}], ["block_4_project_BN", 0, 0, {}]]], "name": "block_4_add"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block_5_expand", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 192, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["block_4_add", 0, 0, {}]]], "name": "block_5_expand"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_5_expand_BN", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.999, "center": true}, "inbound_nodes": [[["block_5_expand", 0, 0, {}]]], "name": "block_5_expand_BN"}, {"class_name": "ReLU", "config": {"max_value": 6.0, "trainable": true, "name": "block_5_expand_relu"}, "inbound_nodes": [[["block_5_expand_BN", 0, 0, {}]]], "name": "block_5_expand_relu"}, {"class_name": "DepthwiseConv2D", "config": {"use_bias": false, "trainable": true, "name": "block_5_depthwise", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "depth_multiplier": 1, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["block_5_expand_relu", 0, 0, {}]]], "name": "block_5_depthwise"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_5_depthwise_BN", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.999, "center": true}, "inbound_nodes": [[["block_5_depthwise", 0, 0, {}]]], "name": "block_5_depthwise_BN"}, {"class_name": "ReLU", "config": {"max_value": 6.0, "trainable": true, "name": "block_5_depthwise_relu"}, "inbound_nodes": [[["block_5_depthwise_BN", 0, 0, {}]]], "name": "block_5_depthwise_relu"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block_5_project", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["block_5_depthwise_relu", 0, 0, {}]]], "name": "block_5_project"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_5_project_BN", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.999, "center": true}, "inbound_nodes": [[["block_5_project", 0, 0, {}]]], "name": "block_5_project_BN"}, {"class_name": "Add", "config": {"trainable": true, "name": "block_5_add"}, "inbound_nodes": [[["block_4_add", 0, 0, {}], ["block_5_project_BN", 0, 0, {}]]], "name": "block_5_add"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block_6_expand", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 192, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["block_5_add", 0, 0, {}]]], "name": "block_6_expand"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_6_expand_BN", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.999, "center": true}, "inbound_nodes": [[["block_6_expand", 0, 0, {}]]], "name": "block_6_expand_BN"}, {"class_name": "ReLU", "config": {"max_value": 6.0, "trainable": true, "name": "block_6_expand_relu"}, "inbound_nodes": [[["block_6_expand_BN", 0, 0, {}]]], "name": "block_6_expand_relu"}, {"class_name": "DepthwiseConv2D", "config": {"use_bias": false, "trainable": true, "name": "block_6_depthwise", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "depth_multiplier": 1, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [2, 2], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["block_6_expand_relu", 0, 0, {}]]], "name": "block_6_depthwise"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_6_depthwise_BN", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.999, "center": true}, "inbound_nodes": [[["block_6_depthwise", 0, 0, {}]]], "name": "block_6_depthwise_BN"}, {"class_name": "ReLU", "config": {"max_value": 6.0, "trainable": true, "name": "block_6_depthwise_relu"}, "inbound_nodes": [[["block_6_depthwise_BN", 0, 0, {}]]], "name": "block_6_depthwise_relu"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block_6_project", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["block_6_depthwise_relu", 0, 0, {}]]], "name": "block_6_project"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_6_project_BN", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.999, "center": true}, "inbound_nodes": [[["block_6_project", 0, 0, {}]]], "name": "block_6_project_BN"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block_7_expand", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 384, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["block_6_project_BN", 0, 0, {}]]], "name": "block_7_expand"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_7_expand_BN", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.999, "center": true}, "inbound_nodes": [[["block_7_expand", 0, 0, {}]]], "name": "block_7_expand_BN"}, {"class_name": "ReLU", "config": {"max_value": 6.0, "trainable": true, "name": "block_7_expand_relu"}, "inbound_nodes": [[["block_7_expand_BN", 0, 0, {}]]], "name": "block_7_expand_relu"}, {"class_name": "DepthwiseConv2D", "config": {"use_bias": false, "trainable": true, "name": "block_7_depthwise", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "depth_multiplier": 1, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["block_7_expand_relu", 0, 0, {}]]], "name": "block_7_depthwise"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_7_depthwise_BN", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.999, "center": true}, "inbound_nodes": [[["block_7_depthwise", 0, 0, {}]]], "name": "block_7_depthwise_BN"}, {"class_name": "ReLU", "config": {"max_value": 6.0, "trainable": true, "name": "block_7_depthwise_relu"}, "inbound_nodes": [[["block_7_depthwise_BN", 0, 0, {}]]], "name": "block_7_depthwise_relu"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block_7_project", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["block_7_depthwise_relu", 0, 0, {}]]], "name": "block_7_project"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_7_project_BN", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.999, "center": true}, "inbound_nodes": [[["block_7_project", 0, 0, {}]]], "name": "block_7_project_BN"}, {"class_name": "Add", "config": {"trainable": true, "name": "block_7_add"}, "inbound_nodes": [[["block_6_project_BN", 0, 0, {}], ["block_7_project_BN", 0, 0, {}]]], "name": "block_7_add"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block_8_expand", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 384, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["block_7_add", 0, 0, {}]]], "name": "block_8_expand"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_8_expand_BN", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.999, "center": true}, "inbound_nodes": [[["block_8_expand", 0, 0, {}]]], "name": "block_8_expand_BN"}, {"class_name": "ReLU", "config": {"max_value": 6.0, "trainable": true, "name": "block_8_expand_relu"}, "inbound_nodes": [[["block_8_expand_BN", 0, 0, {}]]], "name": "block_8_expand_relu"}, {"class_name": "DepthwiseConv2D", "config": {"use_bias": false, "trainable": true, "name": "block_8_depthwise", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "depth_multiplier": 1, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["block_8_expand_relu", 0, 0, {}]]], "name": "block_8_depthwise"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_8_depthwise_BN", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.999, "center": true}, "inbound_nodes": [[["block_8_depthwise", 0, 0, {}]]], "name": "block_8_depthwise_BN"}, {"class_name": "ReLU", "config": {"max_value": 6.0, "trainable": true, "name": "block_8_depthwise_relu"}, "inbound_nodes": [[["block_8_depthwise_BN", 0, 0, {}]]], "name": "block_8_depthwise_relu"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block_8_project", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["block_8_depthwise_relu", 0, 0, {}]]], "name": "block_8_project"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_8_project_BN", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.999, "center": true}, "inbound_nodes": [[["block_8_project", 0, 0, {}]]], "name": "block_8_project_BN"}, {"class_name": "Add", "config": {"trainable": true, "name": "block_8_add"}, "inbound_nodes": [[["block_7_add", 0, 0, {}], ["block_8_project_BN", 0, 0, {}]]], "name": "block_8_add"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block_9_expand", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 384, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["block_8_add", 0, 0, {}]]], "name": "block_9_expand"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_9_expand_BN", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.999, "center": true}, "inbound_nodes": [[["block_9_expand", 0, 0, {}]]], "name": "block_9_expand_BN"}, {"class_name": "ReLU", "config": {"max_value": 6.0, "trainable": true, "name": "block_9_expand_relu"}, "inbound_nodes": [[["block_9_expand_BN", 0, 0, {}]]], "name": "block_9_expand_relu"}, {"class_name": "DepthwiseConv2D", "config": {"use_bias": false, "trainable": true, "name": "block_9_depthwise", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "depth_multiplier": 1, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["block_9_expand_relu", 0, 0, {}]]], "name": "block_9_depthwise"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_9_depthwise_BN", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.999, "center": true}, "inbound_nodes": [[["block_9_depthwise", 0, 0, {}]]], "name": "block_9_depthwise_BN"}, {"class_name": "ReLU", "config": {"max_value": 6.0, "trainable": true, "name": "block_9_depthwise_relu"}, "inbound_nodes": [[["block_9_depthwise_BN", 0, 0, {}]]], "name": "block_9_depthwise_relu"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block_9_project", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["block_9_depthwise_relu", 0, 0, {}]]], "name": "block_9_project"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_9_project_BN", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.999, "center": true}, "inbound_nodes": [[["block_9_project", 0, 0, {}]]], "name": "block_9_project_BN"}, {"class_name": "Add", "config": {"trainable": true, "name": "block_9_add"}, "inbound_nodes": [[["block_8_add", 0, 0, {}], ["block_9_project_BN", 0, 0, {}]]], "name": "block_9_add"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block_10_expand", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 384, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["block_9_add", 0, 0, {}]]], "name": "block_10_expand"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_10_expand_BN", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.999, "center": true}, "inbound_nodes": [[["block_10_expand", 0, 0, {}]]], "name": "block_10_expand_BN"}, {"class_name": "ReLU", "config": {"max_value": 6.0, "trainable": true, "name": "block_10_expand_relu"}, "inbound_nodes": [[["block_10_expand_BN", 0, 0, {}]]], "name": "block_10_expand_relu"}, {"class_name": "DepthwiseConv2D", "config": {"use_bias": false, "trainable": true, "name": "block_10_depthwise", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "depth_multiplier": 1, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["block_10_expand_relu", 0, 0, {}]]], "name": "block_10_depthwise"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_10_depthwise_BN", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.999, "center": true}, "inbound_nodes": [[["block_10_depthwise", 0, 0, {}]]], "name": "block_10_depthwise_BN"}, {"class_name": "ReLU", "config": {"max_value": 6.0, "trainable": true, "name": "block_10_depthwise_relu"}, "inbound_nodes": [[["block_10_depthwise_BN", 0, 0, {}]]], "name": "block_10_depthwise_relu"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block_10_project", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["block_10_depthwise_relu", 0, 0, {}]]], "name": "block_10_project"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_10_project_BN", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.999, "center": true}, "inbound_nodes": [[["block_10_project", 0, 0, {}]]], "name": "block_10_project_BN"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block_11_expand", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 576, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["block_10_project_BN", 0, 0, {}]]], "name": "block_11_expand"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_11_expand_BN", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, 